/****************************************************************************
* ZclGeneral.h
*
* This source file describes Clusters defined in the ZigBee Cluster Library,
* General document. Some or all of these
*
* Copyright (c) 2007, Freescale, Inc. All rights reserved.
*
*
* No part of this document must be reproduced in any form - including copied,
* transcribed, printed or by any electronic means - without specific written
* permission from Freescale Semiconductor.
*
* [R1] - 053520r16ZB_HA_PTG-Home-Automation-Profile.pdf
* [R2] - 075123r00ZB_AFG-ZigBee_Cluster_Library_Specification.pdf
*
******************************************************************************/
#ifndef _ZCL_GENERAL_H
#define _ZCL_GENERAL_H

#include "ZclOptions.h"
#include "AfApsInterface.h"
#include "AppAfInterface.h"
#include "BeeStackInterface.h"
#include "ZCL.h"


/******************************************************************************
*******************************************************************************
* Public macros and data types definitions.
*******************************************************************************
******************************************************************************/
/*The Level Min and Max values representes the range, in which the Level Control,
  this values are application dependant.
  For the Dimmable Light application:
    When the Level is set to 0, the light shall be turned fully off. When the level is set to 254, the light

#define gZclAttrBasic_HWVersionId_c                0x0300 /* O - HWVersion */
#define gZclAttrBasic_ManufacturerNameId_c         0x0400 /* O - ManufacturerName */
#define gZclAttrBasic_ModelIdentifierId_c          0x0500 /* O - ModelIdentifier */
#define gZclAttrBasic_DateCodeId_c                 0x0600 /* O - DateCode */
#define gZclAttrBasic_PowerSourceId_c              0x0700 /* M - PowerSource */
#define gZclAttrBasic_LocationDescriptionId_c      0x1000 /* O - LocationDescription */
#define gZclAttrBasic_PhysicalEnvironmentId_c      0x1100 /* O - PhysicalEnvironment */
#define gZclAttrBasic_DeviceEnabledId_c            0x1200 /* M - DeviceEnabled Boolean */
#define gZclAttrBasic_AlarmMaskId_c                0x1300 /* O - AlarmMask */
#else
/* basic cluster attribute IDs (see ZclGeneral.c for values) */
#define gZclAttrBasic_ZCLVersionId_c               0x0000 /* M - ZCLVersion */
#define gZclAttrBasic_ApplicationVersionId_c       0x0001 /* O - ApplicationVersion */
#define gZclAttrBasic_StackVersionId_c             0x0002 /* O - StackVersion */
#define gZclAttrBasic_HWVersionId_c                0x0003 /* O - HWVersion */
#define gZclAttrBasic_ManufacturerNameId_c         0x0004 /* O - ManufacturerName */
#define gZclAttrBasic_ModelIdentifierId_c          0x0005 /* O - ModelIdentifier */
#define gZclAttrBasic_DateCodeId_c                 0x0006 /* O - DateCode */
#define gZclAttrBasic_PowerSourceId_c              0x0007 /* M - PowerSource */
#define gZclAttrBasic_LocationDescriptionId_c      0x0010 /* O - LocationDescription */
#define gZclAttrBasic_PhysicalEnvironmentId_c      0x0011 /* O - PhysicalEnvironment */
#define gZclAttrBasic_DeviceEnabledId_c            0x0012 /* M - DeviceEnabled Boolean */
#define gZclAttrBasic_AlarmMaskId_c                0x0013 /* O - AlarmMask */

#endif /* #if ( TRUE == gBigEndian_c ) */

/* power source (8-bit value) */
#define gZclAttrBasicPowerSource_Unknown_c     0x00 /* Unknown */
#define gZclAttrBasicPowerSource_Mains_c       0x01 /* Mains (single phase) */
#define gZclAttrBasicPowerSource_Mains3p_c     0x02 /* Mains (3 phase) */
#define gZclAttrBasicPowerSource_Battery_c     0x03 /* Battery */
#define gZclAttrBasicPowerSource_DC_c          0x04 /* DC source */
#define gZclAttrBasicPowerSource_Emergency1_c  0x05 /* Emergency mains constantly powered */
#define gZclAttrBasicPowerSource_Emergency2_c  0x06 /* Emergency mains and transfer switch */

/* enabled attribute values */
#define gZclDeviceDisabled_c 0x00
#define gZclDeviceEnabled_c  0x01

/* 16-bytes in RAM for location description */
#define gZclAttrBasic_LocationDescriptionLen_c 16

/* Physical Environment  */
#define gZclAttrBasic_PhysicalEnvironment  gZclAttrBasicPhylEnvSpecifiedEnvironment

#define gZclAttrBasicPhyEnvUnspecifiedEnvironment 0x00
#define gZclAttrBasicPhylEnvSpecifiedEnvironment  0x01

/* basic cluster commands */
#define gZclCmdBasic_Reset_c                   0x00 /* O - Reset to Factory Defaults */
#ifdef __IAR_SYSTEMS_ICC__
#pragma pack(1)
#endif
/* reset system to factory defaults */
typedef struct zclBasicResetReq_tag
{
  afAddrInfo_t      addrInfo;   /* IN: source/dst address, cluster, etc... */
  /* no payload, just the command */
} zclBasicResetReq_t;

/* list of attributes in RAM for this cluster */
typedef struct zclBasicAttrsRAM_tag
{
  zclStr16_t LocationDescription;  /* 0x0010 LocationDescription, str16, "" RdWr - O */
  uint8_t PhysicalEnvironment;    /* 0x0011 PhysicalEnvironment, 0x00, RdWr - O */
  uint8_t DeviceEnabled ;         /* 0x0012 DeviceEnabled Boolean, 0x01, RdWr - M */
  uint8_t AlarmMask;              /* 0x0013 AlarmMask, 0x00, RdWr - O */
} zclBasicAttrsRAM_t;

/* list of attributes in ROM for this cluster */
typedef struct zclBasicAttrsROM_tag
{
  uint8_t    ZCLVersion;           /* 0x0000 ZCLVersion - 0x01 - RdOnly - M */
  uint8_t    ApplicationVersion;   /* 0x0001 ApplicationVersion - 0x00 - RdOnly - O */
  uint8_t    StackVersion;         /* 0x0002 StackVersion - 0x00 - RdOnly - O */
  uint8_t    HWVersion;            /* 0x0003 HWVersion - 0x00 - RdOnly - O */
  zclStr32_t ManufacturerName;   /* 0x0004 ManufacturerName - "Freescale", 32 - RdOnly - O */
  zclStr32_t ModelIdentifier;    /* 0x0005 ModelIdentifier - "On/Off Light", 32 - RdOnly - O */
  zclStr16_t DateCode;           /* 0x0006 DateCode - "20081404", 16, - RdOnly - O */
  uint8_t    iPowerSource;       /* 0x0007 PowerSource - 0x01(mains) - M */
} zclBasicAttrsROM_t;

/**********************************************************************
	Power Configuration Cluster (ZigBee Cluster Library Chapter 3.3)
**********************************************************************/

/* Power Configuration Attributes Sets */
#if ( TRUE == gBigEndian_c )
#define gZclAttrPwrConfigMainsInformationSet_c    0x0000    /* Mains Information attributes Set */
#define gZclAttrPwrConfigMainsSettingsSet_c       0x0100    /* Mains Settings attributes Set */
#define gZclAttrPwrConfigBatteryInformationSet_c  0x0200    /* Battery Information attributes Set */
#define gZclAttrPwrConfigBatterySettingsSet_c     0x0300    /* Battery Settings attributes Set */
#else
#define gZclAttrPwrConfigMainsInformationSet_c    0x0000    /* Mains Information attributes Set */
#define gZclAttrPwrConfigMainsSettingsSet_c       0x0001    /* Mains Settings attributes Set */
